const dates = {
    "ujian_sekolah": {
        "description": "統一測驗",
        "date_string": "2024-10-07T08:10+08:00",
        "end_date_string": "2024-10-14T14:10+08:00"
    },
    "SPM_percubaan": {
        "description": "SPM 預試",
        "date_string": "2024-10-21T08:00+08:00",
        "end_date_string": "2024-11-11T11:00+08:00"
    },
    "JUEC": {
        "description": "初中統考",
        "date_string": "2024-11-04T08:10+08:00",
        "end_date_string": "2024-11-07T17:15+08:00"
    },
    "SUEC": {
        "description": "高中統考",
        "date_string": "2024-11-04T08:10+08:00",
        "end_date_string": "2024-11-12T17:00+08:00"
    },
    "SPM_lisan": {
        "description": "SPM 國英語口試",
        "date_string": "2024-12-02T07:50+08:00",
        "end_date_string": "2024-12-19T14:45+08:00"
    },
    "SPM": {
        "description": "SPM 科學實驗考試",
        "date_string": "2024-12-09T07:30+08:00",
        "end_date_string": "2024-12-12T13:00+08:00"
    }
}

const live = {
    "2024-10-16": {
        "高二": "SPM 預試"
    },
    "2024-10-17": {},
    "2024-10-18": {},
    "2024-10-19": "停課 - 教師研習日",
    "2024-10-21": {
        "高二": "SPM 預試"
    },
    "2024-10-22": {
        "高二": "SPM 預試"
    },
    "2024-10-23": {
        "高二": "SPM 預試"
    },
    "2024-10-24": {
        "高二": "SPM 預試"
    },
    "2024-10-25": {
        "初三": "第10節打掃和排考場",
        "高二": "SPM 預試",
        "高三": "第10節打掃和排考場"
    },
    "2024-10-26": "放假",
    "2024-10-28": {
        "初一": "第八節打掃和排考場",
        "初二": "第八節打掃和排考場",
        "初三": "放假",
        "高二": "SPM 預試",
        "高三": "放假"
    },
    "2024-10-29": {
        "高二": "SPM 預試"
    },
    "2024-10-30": "屠妖節假期",
    "2024-10-31": "屠妖節快樂",
}