const dates = {
    "ujian_sekolah": {
        "description": "統一測驗",
        "date_string": "2024-10-07T08:10+08:00",
        "end_date_string": "2024-10-14T14:10+08:00"
    },
    "SPM_percubaan": {
        "description": "SPM 預試",
        "date_string": "2024-10-21T08:00+08:00",
        "end_date_string": "2024-11-11T11:00+08:00"
    },
    "JUEC": {
        "description": "初中統考",
        "date_string": "2024-11-04T08:10+08:00",
        "end_date_string": "2024-11-07T17:15+08:00"
    },
    "SUEC": {
        "description": "高中統考",
        "date_string": "2024-11-04T08:10+08:00",
        "end_date_string": "2024-11-12T17:00+08:00"
    },
    "SPM_lisan": {
        "description": "SPM 國英語口試",
        "date_string": "2024-12-02T07:50+08:00",
        "end_date_string": "2024-12-19T14:45+08:00"
    },
    "SPM": {
        "description": "SPM 科學實驗考試",
        "date_string": "2024-12-09T07:30+08:00",
        "end_date_string": "2024-12-12T13:00+08:00"
    }
}

const live = {
    "2024-10-16": {
        "高二": "SPM 預試"
    },
    "2024-10-17": {},
    "2024-10-18": {},
    "2024-10-19": "停課 - 教師研習日",
    "2024-10-21": {
        "高二": "SPM 預試"
    },
    "2024-10-22": {
        "高二": "SPM 預試"
    },
    "2024-10-23": {
        "高二": "SPM 預試"
    },
    "2024-10-24": {
        "高二": "SPM 預試"
    },
    "2024-10-25": {
        "初三": "第10節打掃和排考場",
        "高二": "SPM 預試",
        "高三": "第10節打掃和排考場"
    },
    "2024-10-26": "放假",
    "2024-10-28": {
        "初三": "放假",
        "高二": "SPM 預試",
        "高三": "放假"
    },
    "2024-10-29": {
        "初一": "第八節打掃和排考場",
        "初二": "第八節打掃和排考場",
        "初三": "放假",
        "高二": "SPM 預試",
        "高三": "放假"
    },
    "2024-10-30": "屠妖節假期",
    "2024-10-31": "屠妖節快樂",
    "2024-11-01": "屠妖節假期",
    "2024-11-02": "屠妖節假期",
    "2024-11-04": {
        "初一": "放假",
        "初二": "放假",
        "初三": "初中統考",
        "高一": "放假",
        "高二": "放假",
        "高三": "高中統考"
    },
    "2024-11-05": {
        "初一": "放假",
        "初二": "放假",
        "初三": "初中統考",
        "高一": "放假",
        "高二": "放假",
        "高三": "高中統考"
    },
    "2024-11-06": {
        "初一": "放假",
        "初二": "放假",
        "初三": "初中統考",
        "高一": "放假",
        "高二": "放假",
        "高三": "高中統考"
    },
    "2024-11-07": {
        "初一": "放假",
        "初二": "放假",
        "初三": "初中統考",
        "高一": "放假",
        "高二": "放假",
        "高三": "高中統考"
    },
    "2024-11-08": {
        "初一": "放假",
        "初二": "放假",
        "初三": "放假",
        "高一": "放假",
        "高二": "SPM 預試",
        "高三": "高中統考"
    },
    "2024-11-09": {
        "初一": "放假",
        "初二": "放假",
        "初三": "放假",
        "高一": "放假",
        "高二": "SPM 預試",
        "高三": "高中統考"
    },
    "2024-11-10": {
        "初一": "星期日",
        "初二": "星期日",
        "初三": "星期日",
        "高一": "星期日",
        "高二": "星期日",
        "高三": "高中統考"
    },
    "2024-11-11": {
        "高二": "正常上課，除SPM 美術科預試考生",
        "高三": "放假"
    },
    "2024-11-12": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "高一": "第三學期大考",
        "高二": "放假",
        "高三": "高中統考 (美術)"
    },
    "2024-11-13": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "高一": "第三學期大考",
        "高二": "放假",
        "高三": "放假"
    },
    "2024-11-14": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "高一": "第三學期大考",
        "高二": "放假",
        "高三": "放假"
    },
    "2024-11-15": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "高一": "第三學期大考",
        "高二": "放假",
        "高三": "放假"
    },
    "2024-11-16": "放假",
    "2024-11-18": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "初三": "放假",
        "高一": "第三學期大考",
        "高三": "放假/社區服務"
    },
    "2024-11-19": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "初三": "放假",
        "高一": "第三學期大考",
        "高三": "放假/社區服務"
    },
    "2024-11-20": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "初三": "放假",
        "高一": "第三學期大考",
        "高三": "放假/社區服務"
    },
    "2024-11-21": {
        "初一": "第三學期大考",
        "初二": "第三學期大考",
        "初三": "放假",
        "高一": "第三學期大考",
        "高三": "放假/社區服務"
    },
    "2024-11-22": {},
    "2024-11-23": "停課 - 教師研習日"
}
